OpenFOAM-10/tutorials/heatTransfer/buoyantFoam/externalCoupledCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    topAndBottom
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    hot
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    cold
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
